SCHEMES = {
    "YSR రైతు భరోసా": {
        "benefit": "₹13,500 వార్షిక రైతు సహాయం",
        "documents": ["ఆధార్", "భూమి పత్రాలు", "బ్యాంక్ ఖాతా"]
    },

    "PM జనధన్ యోజన": {
        "benefit": "జీరో బ్యాలెన్స్ బ్యాంక్ ఖాతా + డెబిట్ కార్డ్",
        "documents": ["ఆధార్"]
    },

    "PM కిసాన్ సమ్మాన్ నిధి": {
        "benefit": "₹6,000 వార్షిక ఆర్థిక సహాయం",
        "documents": ["ఆధార్", "భూమి పత్రాలు"]
    },

    "వృద్ధాప్య పెన్షన్ పథకం": {
        "benefit": "₹2,000 నెలవారీ పెన్షన్",
        "documents": ["ఆధార్", "వయస్సు ధృవీకరణ"]
    },

    "PM ఉజ్వల యోజన": {
        "benefit": "ఉచిత LPG గ్యాస్ కనెక్షన్",
        "documents": ["ఆధార్", "రేషన్ కార్డు"]
    },

    "ఆయుష్మాన్ భారత్": {
        "benefit": "₹5 లక్షల వరకు ఉచిత వైద్య బీమా",
        "documents": ["ఆధార్", "రేషన్ కార్డు"]
    }
}

def retrieve_scheme(schemes):
    if not schemes:
        return None
    return SCHEMES.get(schemes[0])
